{
  "currentVersion": "1.0.5",
  "entries": [
    {
      "date": "14/01/2025",
      "version": "1.0.5",
      "changes": [
        "Added support for the <code>QBCore:Server:UpdateObject</code> event<br>This ensures compatibility with the <code>AddJob</code> and <code>RemoveJob</code> exports.",
        "Added support for Multi Job systems.<br>Currently supported: <code>wasabi_multijob</code>, <code>ps-multijob</code>",
        "Added <code>Config.ClotheMerge</code><br>This allows changing the behavior of the Job Wardrobe system.<br><code>true</code>: keeps the previous behavior, allowing outfits to be merged together. This makes it possible to create multiple outfits that modify only specific parts (e.g. one outfit changing only a head accessory and another changing the uniform).<br><code>false</code>: new behavior that resets the player's previous appearance when changing clothes, meaning outfits cannot be merged in the Job Wardrobe.",
        "Fixed the Wear private clothes option for <code>rcore_clothing</code>.<br>The lookup order for compatible skin managers in the <code>skinmanagerAutoFind</code> function has been adjusted so that <code>rcore_clothing</code> is checked first, ensuring the resource is properly detected and loaded."
      ]
    },
    {
      "date": "13/02/2025",
      "version": "1.0.4",
      "changes": [
        "Fixed a bug that sometimes prevented gangs from changing grades for their members",
        "Changed the method for checking target availability from <code>job</code> to <code>canInteract</code> for qb-target"
      ]
    },
    {
      "date": "11/02/2025",
      "version": "1.0.3",
      "changes": [
        "Added Stash section and ability to customize permissions for grades, in addition, in <code>Config.JobMenusSettings</code> possible to configure <code>allowStash</code>, <code>stashSettings</code><br><code>Config.Inventory</code>: by default compatible with ox_inventory, qb-inventory, origen_inventory, tgiann-inventory, if you have custom you need to make changes in <code>CL.OpenStash</code> / <code>SV.openStash</code>, <code>SV.registerAllStashes</code>",
        "Added support for Renewed-Banking, tgg-banking in Config.Banking",
        "Added Badge column to employee list in menu",
        "Added sql execute for ESX in <code>SV.setPlayerJob</code> and <code>SV.gangPlayerJob</code> to avoid the requirement to wait for the employee list to update",
        "Added automatic entry of badge column when using <code>Config.AutoExecuteQuery</code>",
        "Modified functions that search for the current compatible resource in use",
        "If your rank does not have access to the Options button in employees list, you will not see the entire column",
        "Changed the method for checking target availability from <code>groups</code> to <code>canInteract</code> because target systems do not have the ability to check the gang",
        "Changed method of getting data from database for qb-core from <code>SELECT *</code> to specify columns",
        "Fixed bug preventing some users from opening menus"
      ]
    },
    {
      "date": "02/01/2025",
      "version": "1.0.2",
      "changes": [
        "Added badge number system and its assignment to employees (* Requires adding a new column to its users/players table).",
        "Added support for displaying a list of employees using job duty for ESX, which works like police/offpolice - <code>Config.UseOffDutyJobName</code> & <code>Config.OffDutyJobNamePrefix</code>",
        "Created new server-side exports: <code>getPlayerBadge</code>, <code>getPlayerBadges</code>, <code>setPlayerBadge</code>",
        "Fixed the ability to scroll the list of employee ranks in the clothing section",
        "Fixed a bug that, for some users, required a restart of the resource to load the jobs list from the framework"
      ]
    },
    {
      "date": "24/11/2024",
      "version": "1.0.1",
      "changes": [
        "Added <code>version_check.lua</code> file to check script version and inform about updates",
        "Fixed <code>Society doesnt exist!</code>"
      ]
    }
  ]
}
